IRP/src/Enums/AgreementTypes/AgreementTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AgreementTypes</name>
 <enumValues>
  <name>Customer</name>
 </enumValues>
 <enumValues>
  <name>Vendor</name>
 </enumValues>
 <enumValues>
  <name>Consignor</name>
 </enumValues>
 <enumValues>
  <name>TradeAgent</name>
 </enumValues>
 <enumValues>
  <name>Other</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/AgreementKinds/AgreementKinds.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AgreementKinds</name>
 <enumValues>
  <name>Regular</name>
 </enumValues>
 <enumValues>
  <name>Standard</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/Payroll/Payroll.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>Payroll</name>
 <registerRecords>AccumulationRegister.R5022T_Expenses</registerRecords>
 <registerRecords>AccumulationRegister.R9555T_PaidSickLeaves</registerRecords>
 <registerRecords>AccumulationRegister.R3027B_EmployeeCashAdvance</registerRecords>
 <registerRecords>AccumulationRegister.R9545T_PaidVacations</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.R9510B_SalaryPayment</registerRecords>
 <registerRecords>AccumulationRegister.R5021T_Revenues</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R5015B_OtherPartnersTransactions</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>BeginDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PaymentPeriod</name>
  <type>
   <types>CatalogRef.PlanningPeriods</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_CalculationType</name>
  <type>
   <types>CatalogRef.SalaryCalculationType</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AccrualList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Position</name>
   <type>
    <types>CatalogRef.EmployeePositions</types>
   </type>
  </attributes>
  <attributes>
   <name>AccrualType</name>
   <type>
    <types>CatalogRef.AccrualAndDeductionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TotalVacationDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>PaidVacationDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>TotalSickLeaveDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>PaidSickLeaveDays</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>DeductionList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Position</name>
   <type>
    <types>CatalogRef.EmployeePositions</types>
   </type>
  </attributes>
  <attributes>
   <name>DeductionType</name>
   <type>
    <types>CatalogRef.AccrualAndDeductionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>IsRevenue</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>CashAdvanceDeductionList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>Agreement</name>
   <type>
    <types>CatalogRef.Agreements</types>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SalaryTaxList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Employee</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>Tax</name>
   <type>
    <types>CatalogRef.Taxes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>CalculationType</name>
   <type>
    <types>CatalogRef.SalaryCalculationType</types>
   </type>
  </attributes>
  <attributes>
   <name>Agreement</name>
   <type>
    <types>CatalogRef.Agreements</types>
   </type>
  </attributes>
  <attributes>
   <name>TakeAccountFromTaxes</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Partner</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalName</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/CommonModules/DocPayrollClient/Module.bsl
#Region FORM

Procedure OnOpen(Object, Form, Cancel, AddInfo = Undefined) Export
	ViewClient_V2.OnOpen(Object, Form, Form.MainTables);
EndProcedure

Procedure AfterWriteAtClient(Object, Form, WriteParameters) Export
	Return;
EndProcedure

#EndRegion

#Region _DATE

Procedure DateOnChange(Object, Form, Item) Export
	ViewClient_V2.DateOnChange(Object, Form, Form.MainTables);
EndProcedure

Procedure BeginDateOnChange(Object, Form, Item) Export
	ViewClient_V2.BeginDateOnChange(Object, Form, Form.MainTables);
EndProcedure

Procedure EndDateOnChange(Object, Form, Item) Export
	ViewClient_V2.EndDateOnChange(Object, Form, Form.MainTables);
EndProcedure

#EndRegion

#Region PAYMENT_PERIOD

Procedure PaymentPeriodOnChange(Object, Form, Item) Export
	ViewClient_V2.PlanningPeriodOnChange(Object, Form, Form.MainTables);
EndProcedure

#EndRegion

#Region COMPANY

Procedure CompanyOnChange(Object, Form, Item) Export
	ViewClient_V2.CompanyOnChange(Object, Form, Form.MainTables);
EndProcedure

#EndRegion

#Region CURRENCY

Procedure CurrencyOnChange(Object, Form, Item) Export
	ViewClient_V2.CurrencyOnChange(Object, Form, Form.MainTables);
EndProcedure

#EndRegion

#Region PAYROLL_LISTS

Procedure PayrollListsSelection(Object, Form, Item, RowSelected, Field, StandardProcessing) Export
	ViewClient_V2.PayrollListsSelection(Object, Form, Item, RowSelected, Field, StandardProcessing);
EndProcedure

Procedure PayrollListsBeforeAddRow(Object, Form, Item, Cancel, Clone, Parent, IsFolder, Parameter) Export
	ViewClient_V2.PayrollListsBeforeAddRow(Object, Form, Item.Name, Cancel, Clone);
EndProcedure

Procedure PayrollListsBeforeDeleteRow(Object, Form, Item, Cancel) Export
	Return;
EndProcedure

Procedure PayrollListsAfterDeleteRow(Object, Form, Item) Export
	ViewClient_V2.PayrollListsAfterDeleteRow(Object, Form, Item.Name);
EndProcedure

#Region SALARY_TAX_LIST

#Region SALARY_TAX_LIST_PARTNER

Procedure SalaryTaxListPartnerOnChange(Object, Form, Item, CurrentData = Undefined) Export
	ViewClient_V2.SalaryTaxListPartnerOnChange(Object, Form, CurrentData);
EndProcedure

Procedure SalaryTaxListPartnerStartChoice(Object, Form, Item, ChoiceData, StandardProcessing) Export
	OpenSettings = DocumentsClient.GetOpenSettingsStructure();
	OpenSettings.ArrayOfFilters = New Array();
	OpenSettings.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("DeletionMark", True, DataCompositionComparisonType.NotEqual));
	OpenSettings.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Other", True, DataCompositionComparisonType.Equal));
	OpenSettings.FormParameters = New Structure();
	OpenSettings.FillingData = New Structure();
	DocumentsClient.PartnerStartChoice(Object, Form, Item, ChoiceData, StandardProcessing, OpenSettings);
EndProcedure

Procedure SalaryTaxListPartnerEditTextChange(Object, Form, Item, Text, StandardProcessing) Export
	ArrayOfFilters = New Array();
	ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("DeletionMark", True, ComparisonType.NotEqual));
	ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Other", True, ComparisonType.Equal));
	AdditionalParameters = New Structure();
	DocumentsClient.PartnerEditTextChange(Object, Form, Item, Text, StandardProcessing, ArrayOfFilters, AdditionalParameters);
EndProcedure

#EndRegion

#Region SALARY_TAX_LIST_LEGAL_NAME

Procedure SalaryTaxListLegalNameOnChange(Object, Form, Item, CurrentData = Undefined) Export
	ViewClient_V2.SalaryTaxListLegalNameOnChange(Object, Form, CurrentData);
EndProcedure

Procedure SalaryTaxListLegalNameStartChoice(Object, Form, Item, ChoiceData, StandardProcessing) Export
	CurrentData = Form.Items.SalaryTaxList.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	OpenSettings = DocumentsClient.GetOpenSettingsStructure();
	OpenSettings.ArrayOfFilters = New Array();
	OpenSettings.ArrayOfFilters.Add(
		DocumentsClientServer.CreateFilterItem("DeletionMark", True, DataCompositionComparisonType.NotEqual));
	OpenSettings.ArrayOfFilters.Add(
		DocumentsClientServer.CreateFilterItem("Partner", CurrentData.Partner, DataCompositionComparisonType.Equal));
	OpenSettings.FormParameters = New Structure();
	OpenSettings.FormParameters.Insert("Partner", CurrentData.Partner);
	OpenSettings.FormParameters.Insert("FilterByPartnerHierarchy", True);
	OpenSettings.FillingData = New Structure("Partner", CurrentData.Partner);

	DocumentsClient.CompanyStartChoice(Object, Form, Item, ChoiceData, StandardProcessing, OpenSettings);
EndProcedure

Procedure SalaryTaxListLegalNameEditTextChange(Object, Form, Item, Text, StandardProcessing) Export
	CurrentData = Form.Items.SalaryTaxList.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	ArrayOfFilters = New Array();
	ArrayOfFilters.Add(
		DocumentsClientServer.CreateFilterItem("DeletionMark", True, ComparisonType.NotEqual));
	ArrayOfFilters.Add(
		DocumentsClientServer.CreateFilterItem("Partner", CurrentData.Partner, ComparisonType.Equal));
	AdditionalParameters = New Structure();
	AdditionalParameters.Insert("Partner", CurrentData.Partner);
	AdditionalParameters.Insert("FilterByPartnerHierarchy", True);
	DocumentsClient.CompanyEditTextChange(Object, Form, Item, Text, StandardProcessing, ArrayOfFilters, AdditionalParameters);
EndProcedure

#EndRegion

#Region SALARY_TAX_LIST_AGREEMENT

Procedure SalaryTaxListAgreementOnChange(Object, Form, Item, CurrentData = Undefined) Export
	ViewClient_V2.SalaryTaxListAgreementOnChange(Object, Form, CurrentData);
EndProcedure

Procedure SalaryTaxListAgreementStartChoice(Object, Form, Item, ChoiceData, StandardProcessing) Export
	CurrentData = Form.Items.SalaryTaxList.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	OpenSettings = DocumentsClient.GetOpenSettingsStructure();

	OpenSettings.ArrayOfFilters = New Array();
	OpenSettings.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("DeletionMark", True, DataCompositionComparisonType.NotEqual));
	OpenSettings.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Type", PredefinedValue("Enum.AgreementTypes.Other"), DataCompositionComparisonType.Equal));
	OpenSettings.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Kind", PredefinedValue("Enum.AgreementKinds.Standard"), DataCompositionComparisonType.NotEqual));
	
	OpenSettings.FormParameters = New Structure();
	OpenSettings.FormParameters.Insert("Partner"                     , CurrentData.Partner);
	OpenSettings.FormParameters.Insert("IncludeFilterByPartner"      , True);
	OpenSettings.FormParameters.Insert("IncludePartnerSegments"      , True);
	OpenSettings.FormParameters.Insert("EndOfUseDate"                , Object.Date);
	OpenSettings.FormParameters.Insert("IncludeFilterByEndOfUseDate" , True);
	
	OpenSettings.FillingData = New Structure();
	OpenSettings.FillingData.Insert("Partner"   , CurrentData.Partner);
	OpenSettings.FillingData.Insert("LegalName" , CurrentData.LegalName);
	OpenSettings.FillingData.Insert("Company"   , Object.Company);
	OpenSettings.FillingData.Insert("Type"      , PredefinedValue("Enum.AgreementTypes.Other"));

	DocumentsClient.AgreementStartChoice(Object, Form, Item, ChoiceData, StandardProcessing, OpenSettings);
EndProcedure

Procedure SalaryTaxListAgreementEditTextChange(Object, Form, Item, Text, StandardProcessing) Export
	CurrentData = Form.Items.SalaryTaxList.CurrentData;
	If CurrentData = Undefined Then
		Return;
	EndIf;
	
	ArrayOfFilters = New Array();
	ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("DeletionMark", True, ComparisonType.NotEqual));
	ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Type", PredefinedValue("Enum.AgreementTypes.Other"),ComparisonType.Equal));
	ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Kind", PredefinedValue("Enum.AgreementKinds.Standard"),ComparisonType.NotEqual));
	AdditionalParameters = New Structure();
	AdditionalParameters.Insert("IncludeFilterByEndOfUseDate" , True);
	AdditionalParameters.Insert("IncludeFilterByPartner"      , True);
	AdditionalParameters.Insert("IncludePartnerSegments"      , True);
	AdditionalParameters.Insert("EndOfUseDate"                , Object.Date);
	AdditionalParameters.Insert("Partner"                     , CurrentData.Partner);
	DocumentsClient.AgreementEditTextChange(Object, Form, Item, Text, StandardProcessing, ArrayOfFilters, AdditionalParameters);
EndProcedure

#EndRegion

#EndRegion

#Region ACCRUAL_LIST_COLUMNS

#Region ACCRUAL_DEDUCTION_TYPE

Procedure PayrollListsAccrualDeductionTypeOnChange(Object, Form, Item, TableName, CurrentData = Undefined) Export
	ViewClient_V2.PayrollListsAccrualDeductionTypeOnChange(Object, Form, TableName, CurrentData);
EndProcedure

#EndRegion

Procedure PayrollListsAmountOnChange(Object, Form, Item, TableName, CurrentData = Undefined) Export
	ViewClient_V2.PayrollListsAmountOnChange(Object, Form, TableName, CurrentData);
EndProcedure

Procedure PayrollListsEmployeeOnChange(Object, Form, Item, TableName, CurrentData = Undefined) Export
	ViewClient_V2.PayrollListsEmployeeOnChange(Object, Form, TableName, CurrentData);
EndProcedure

#EndRegion

#EndRegion

Procedure ChoiceByAccrual(Object, Form) Export
	OpenParameters = New Structure();
	OpenParameters.Insert("Company"  , Object.Company);
	OpenParameters.Insert("Branch"   , Object.Branch);
	OpenParameters.Insert("Currency" , Object.Currency);
	OpenParameters.Insert("Ref"      , Object.Ref);
	
	ArrayOfEmployee = New Array();
	For Each Row In Object.PaymentList Do
		ArrayOfEmployee.Add(Row.Employee);
	EndDo;
	OpenParameters.Insert("ArrayOfEmployee", ArrayOfEmployee);
	
	Notify = New CallbackDescription("ChoiceByAccrualEnd", ThisObject,New Structure("Object, Form", Object, Form));
	OpenForm("Document.Payroll.Form.ChoiceByAccrualForm", OpenParameters, Form, New UUID(), , , 
		Notify, FormWindowOpeningMode.LockOwnerWindow);	
EndProcedure

Procedure ChoiceByAccrualEnd(Result, Params) Export
	If Result = Undefined Then
		Return;
	EndIf;
	TableInfo = DocPayrollServer.PutChoiceDataToServerStorage(Result.ArrayOfDataRows, Params.Form.UUID);
	ViewClient_V2.PaymentListLoad(Params.Object, Params.Form, TableInfo.Address, TableInfo.GroupColumn, TableInfo.SumColumn);
EndProcedure
